// 0. Демонстрация решения
// Напишите программу, которая 
// 1.на вход принимает число 
// 2. и выдаёт его квадрат (число умноженное на само себя).
// Например:
// 4 -> 16
// -3 -> 9
// -7 -> 49

int a = 4;
int b = -3;
int c = -7;

int res1 = a * a;
int res2 = b * b;
int res3 = c * c;

Console.WriteLine(res1);
Console.WriteLine(res2);
Console.WriteLine(res3);
